app/views/teachers/show.html.haml

                  %tbody
                    - @teacher.classrooms.each do |classroom|
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."teacher_id" = 1