app/controllers/classrooms_controller.rb

  def create
  	@teacher = session[:teacher]
  	@teacher.classrooms.create(params[:classroom])
---
INSERT INTO "classrooms" ("class_type", "created_at", "end_date", "name", "program", "start_date", "teacher_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @teacher = session[:teacher]
    params[:teacher_id] = @teacher.id
    if !@teacher.classrooms.include?(Classroom.find(params[:id].to_i))
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", "1"]]

  def create_link
    if not @classroom
      @classroom = Classroom.find(params[:id])
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", "1"]]